NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/MGM24/MGM240PB32VNN.svd
        <register>
          <name>CLKEN1</name>
          <description>No Description</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7EFFEFFF</resetMask>
          <fields>
            <field>
              <name>AGC</name>
              <description>Enable Bus Clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODEM</name>
              <description>Enable Bus Clock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCRC</name>
              <description>Enable Bus Clock</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRC</name>
              <description>Enable Bus Clock</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROTIMER</name>
              <description>Enable Bus Clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAC</name>
              <description>Enable Bus Clock</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNTH</name>
              <description>Enable Bus Clock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFSCRATCHPAD</name>
              <description>Enable Bus Clock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HOSTMAILBOX</name>
              <description>Enable Bus Clock</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFMAILBOX</name>
              <description>Enable Bus Clock</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEMAILBOXHOST</name>
              <description>Enable Bus Clock</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFC</name>
              <description>Enable Bus Clock</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>KEYSCAN</name>
              <description>Enable Bus Clock</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMU</name>
              <description>Enable Bus Clock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ICACHE0</name>
              <description>Enable Bus Clock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSC</name>
              <description>Enable Bus Clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDOG1</name>
              <description>Enable Bus Clock</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP0</name>
              <description>Enable Bus Clock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP1</name>
              <description>Enable Bus Clock</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDAC0</name>
              <description>Enable Bus Clock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PCNT0</name>
              <description>Enable Bus Clock</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EUSART0</name>
              <description>Enable Bus Clock</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EUSART1</name>
              <description>Enable Bus Clock</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFECA0</name>
              <description>Enable Bus Clock</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RFECA1</name>
              <description>Enable Bus Clock</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMEM</name>
              <description>Enable Bus Clock</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ECAIFADC</name>
              <description>Enable Bus Clock</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDAC1</name>
              <description>Enable Bus Clock</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MVP</name>
              <description>Enable Bus Clock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0001F507</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking SYSCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking SYSCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking SYSCLK</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKIN0</name>
                  <description>CLKIN0 is clocking SYSCLK</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCLKPRESC</name>
              <description>PCLK Prescaler</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>PCLK is HCLK divided by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>PCLK is HCLK divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCLKPRESC</name>
              <description>HCLK Prescaler</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>HCLK is SYSCLK divided by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>HCLK is SYSCLK divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>HCLK is SYSCLK divided by 4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>HCLK is SYSCLK divided by 8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>HCLK is SYSCLK divided by 16</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RHCLKPRESC</name>
              <description>Radio HCLK Prescaler</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Radio HCLK is SYSCLK divided by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Radio HCLK is SYSCLK divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACECLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000033</resetMask>
          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Clock Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>TRACE clock is disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSCLK</name>
                  <description>SYSCLK is driving TRACE</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is driving TRACE</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLLRT</name>
                  <description>HFRCODPLLRT is driving TRACE</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>TRACECLK Prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>TRACECLK is SYSCLK divided by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>TRACECLK is SYSCLK divided by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV3</name>
                  <description>TRACECLK is SYSCLK divided by 3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>TRACECLK is SYSCLK divided by 4</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXPORTCLKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x090</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F0F0F0F</resetMask>
          <fields>
            <field>
              <name>CLKOUTSEL0</name>
              <description>Clock Output Select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CLKOUT0 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK is clocking CLKOUT0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>EXPORTCLK is clocking CLKOUT0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking CLKOUT0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking CLKOUT0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking CLKOUT0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking CLKOUT0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking CLKOUT0</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking CLKOUT0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking CLKOUT0</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL1</name>
              <description>Clock Output Select 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CLKOUT1 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK is clocking CLKOUT1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>EXPORTCLK is clocking CLKOUT1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking CLKOUT1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking CLKOUT1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking CLKOUT1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking CLKOUT1</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking CLKOUT1</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking CLKOUT1</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking CLKOUT1</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKOUTSEL2</name>
              <description>Clock Output Select 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>CLKOUT2 is not clocked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK is clocking CLKOUT2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFEXPCLK</name>
                  <description>EXPORTCLK is clocking CLKOUT2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULFRCO</name>
                  <description>ULFRCO is clocking CLKOUT2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFRCO</name>
                  <description>LFRCO is clocking CLKOUT2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXO</name>
                  <description>LFXO is clocking CLKOUT2</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCODPLL</name>
                  <description>HFRCODPLL is clocking CLKOUT2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXO</name>
                  <description>HFXO is clocking CLKOUT2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSRCO</name>
                  <description>FSRCO is clocking CLKOUT2</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRCOEM23</name>
                  <description>HFRCOEM23 is clocking CLKOUT2</description>
                  <value>9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRESC</name>
              <description>EXPORTCLK Prescaler</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
